{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"trainable": true, "output_dim": 256, "input_dim": 20000, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "name": "embedding_1", "input_length": 200, "batch_input_shape": [null, 200], "dtype": "float32", "embeddings_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "activity_regularizer": null}}, {"class_name": "CuDNNLSTM", "config": {"trainable": true, "kernel_regularizer": null, "go_backwards": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "recurrent_constraint": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "name": "cu_dnnlstm_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.6}}, {"class_name": "CuDNNLSTM", "config": {"trainable": true, "kernel_regularizer": null, "go_backwards": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "stateful": false, "bias_constraint": null, "return_sequences": true, "recurrent_constraint": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "name": "cu_dnnlstm_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.6}}, {"class_name": "CuDNNLSTM", "config": {"trainable": true, "kernel_regularizer": null, "go_backwards": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "stateful": false, "bias_constraint": null, "return_sequences": false, "recurrent_constraint": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "name": "cu_dnnlstm_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.6}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid"}}]}}